Table of Contents
 Class GrpcReflectionServiceContractReflection
Namespace
IdeaStatiCa.Plugin.Grpc
Assembly
IdeaStatiCa.Plugin.dll
Holder for reflection information generated from Grpc/GrpcReflectionServiceContract.proto
public static class GrpcReflectionServiceContractReflection
Inheritance
object
GrpcReflectionServiceContractReflection
Inherited Members
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
Properties
 Descriptor
File descriptor for Grpc/GrpcReflectionServiceContract.proto
public static FileDescriptor Descriptor { get; }
Property Value
FileDescriptor
 Edit this page